{
	"name": "YouTube",
    "desc": "The Data API allows users to integrate their program with YouTube and allow it to perform many of the operations available on the website. It provides the capability to search for videos, retrieve standard feeds, and see related content. A program can also authenticate as a user to upload videos, modify user playlists, and more. This integration can be used for a variety of uses such as developing a web application allowing users to upload video to YouTube, or a device or desktop application that brings the YouTube experience to a new platform. The Data API gives users programmatic access to the video and user information stored on YouTube. This can be used to personalize a web site or application with the user's existing information as well as perform actions like commenting on and rating videos. This RESTful API provides responses in XML format.",
	"url": "https://accounts.google.com/o/oauth2",
	"oauth2": {
		"authorize": "/auth",
		"access_token": "/token",
		"request": "https://www.googleapis.com",
		"refresh": "/token",
		"parameters": {
			"client_secret": "string",
			"client_id": "string",
			"scope": {
				"values": {
					"https://www.googleapis.com/auth/yt-analytics.readonly": "View YouTube Analytics reports for your YouTube content",
					"https://www.googleapis.com/auth/youtube": "Manage your YouTube account",
					"https://www.googleapis.com/auth/youtubepartner": "View and manage your assets and associated content on YouTube",
					"https://www.googleapis.com/auth/youtube.upload": "Manage your YouTube videos",
					"https://www.googleapis.com/auth/youtube.readonly": "View your YouTube account",
					"https://www.googleapis.com/auth/yt-analytics-monetary.readonly": "View YouTube Analytics monetary reports for your YouTube content"
				}
			}
		}
	},
	"href": {
		"keys": "https://code.google.com/apis/console/",
		"docs": "http://code.google.com/more/",
		"apps": "https://code.google.com/apis/console/",
		"provider": "http://google.com/"
	}
}