{
	"name": "Facebook",
	"desc": "At Facebook's core is the social graph; people and the connections they have to everything they care about. The Graph API presents a simple, consistent view of the Facebook social graph, uniformly representing objects in the graph (e.g., people, photos, events, and pages) and the connections between them (e.g., friend relationships, shared content, and photo tags). Public information can be accessed without a developer key/application key, but is required for private data access.",
	"url": "https://graph.facebook.com",
	"oauth2": {
		"authorize": "https://www.facebook.com/{api_version}dialog/oauth",
		"access_token": "/{api_version}oauth/access_token",
		"request": {
			"cors": true,
			"query": {
				"access_token": "{{token}}"
			}
		},
		"refresh": {
			"url": "/{api_version}oauth/access_token",
			"query": {
				"grant_type": "fb_exchange_token",
				"client_id": "{client_id}",
				"client_secret": "{client_secret}",
				"fb_exchange_token": "{{refresh_token}}"
			}
		},
		"revoke": {
			"url": "/{api_version}me/permissions",
			"method": "delete",
			"query": {
				"access_token": "{{token}}"
			}
		},
		"parameters": {
			"client_id": "string",
			"client_secret": "string",
			"scope": {
				"values": {
					"instagram_basic": "Provides the ability to read Instagram accounts you have access to",
					"instagram_content_publish": "Provides the ability to publish content to Instagram account you have access to",
					"instagram_manage_comments": "Provides the ability to read Instagram accounts you have access to",
					"instagram_manage_insights": "Provides the ability to read insights of Instagram account you have access to",
					"friends_groups": "Provides access to the list of groups the user is a member of as the groups connection",
					"friends_actions.music": "Allows you to retrieve the actions published by all applications using the built-in music.listens action.",
					"friends_relationship_details": "Provides access to the user's relationship preferences",
					"user_events": "Provides access to the list of events the user is attending as the events connection",
					"create_event": "Enables your application to create and modify events on the user's behalf",
					"publish_checkins": "Enables your app to perform checkins on behalf of the user.",
					"manage_friendlists": "Enables your app to create and edit the user's friend lists.",
					"user_birthday": "Provides access to the birthday with year as the birthday property",
					"friends_games_activity": "Allows you post and retrieve game achievement activity.",
					"friends_interests": "Provides access to the user's list of interests as the interests connection",
					"user_checkins": "Provides read access to the authorized user's check-ins or a friend's check-ins that the user can see. This permission is superseded by user_status for new applications as of March, 2012.",
					"friends_notes": "Provides access to the user's notes as the notes connection",
					"user_education_history": "Provides access to education history as the education property",
					"user_videos": "Provides access to the videos the user has uploaded, and videos the user has been tagged in",
					"friends_events": "Provides access to the list of events the user is attending as the events connection",
					"user_subscriptions": "Provides access to the user's subscribers and subscribees",
					"manage_notifications": "Enables your app to read notifications and mark them as read. Intended usage: This permission should be used to let users read and act on their notifications; it should not be used to for the purposes of modeling user behavior or data mining. Apps that misuse this permission may be banned from requesting it.",
					"user_status": "Provides access to the user's status messages and checkins. Please see the documentation for the location_post table for information on how this permission may affect retrieval of information about the locations associated with posts.",
					"friends_website": "Provides access to the user's web site URL",
					"user_relationships": "Provides access to the user's family and personal relationships and relationship status",
					"user_games_activity": "Allows you post and retrieve game achievement activity.",
					"friends_relationships": "Provides access to the user's family and personal relationships and relationship status",
					"user_website": "Provides access to the user's web site URL",
					"friends_actions.video": "Allows you to retrieve the actions published by all applications using the built-in video.watches action.",
					"friends_online_presence": "Provides access to the user's friend's online/offline presence",
					"manage_pages": "Enables your application to retrieve access_tokens for Pages and Applications that the user administrates. The access tokens can be queried by calling /<user_id>/accounts via the Graph API. See here for generating long-lived Page access tokens that do not expire after 60 days.",
					"xmpp_login": "Provides applications that integrate with Facebook Chat the ability to log in users.",
					"friends_religion_politics": "Provides access to the user's religious and political affiliations",
					"friends_photos": "Provides access to the photos the user has uploaded, and photos the user has been tagged in",
					"rsvp_event": "Enables your application to RSVP to events on the user's behalf",
					"friends_location": "Provides access to the user's current location as the location property",
					"user_hometown": "Provides access to the user's hometown in the hometown property",
					"friends_education_history": "Provides access to education history as the education property",
					"email": "Provides access to the user's primary email address in the email property. Do not spam users. Your use of email must comply both with Facebook policies and with the CAN-SPAM Act.",
					"friends_about_me": "Provides access to the \"About Me\" section of the profile in the about property",
					"friends_likes": "Provides access to the list of all of the pages the user has liked as the likes connection",
					"friends_questions": "Provides access to the questions the user or friend has asked",
					"user_interests": "Provides access to the user's list of interests as the interests connection",
					"read_friendlists": "Provides access to any friend lists the user created. All user's friends are provided as part of basic data, this extended permission grants access to the lists of friends a user has created, and should only be requested if your application utilizes lists of friends.",
					"friends_activities": "Provides access to the user's list of activities as the activities connection",
					"read_requests": "Provides read access to the user's friend requests",
					"friends_subscriptions": "Provides access to the user's subscribers and subscribees",
					"friends_videos": "Provides access to the videos the user has uploaded, and videos the user has been tagged in",
					"user_groups": "Provides access to the list of groups the user is a member of as the groups connection",
					"read_stream": "Provides access to all the posts in the user's News Feed and enables your application to perform searches against the user's News Feed",
					"user_religion_politics": "Provides access to the user's religious and political affiliations",
					"read_mailbox": "Provides the ability to read from a user's Facebook Inbox.",
					"friends_birthday": "Provides access to the birthday with year as the birthday property",
					"user_about_me": "Provides access to the \"About Me\" section of the profile in the about property",
					"user_activities": "Provides access to the user's list of activities as the activities connection",
					"user_online_presence": "Provides access to the user's online/offline presence",
					"friends_work_history": "Provides access to work history as the work property",
					"friends_status": "Provides access to the user's status messages and checkins. Please see the documentation for the location_post table for information on how this permission may affect retrieval of information about the locations associated with posts.",
					"user_work_history": "Provides access to work history as the work property",
					"user_actions.news": "Allows you to retrieve the actions published by all applications using the built-in news.reads action.",
					"friends_hometown": "Provides access to the user's hometown in the hometown property",
					"user_actions.video": "Allows you to retrieve the actions published by all applications using the built-in video.watches action.",
					"read_insights": "Provides read access to the Insights data for pages, applications, and domains the user owns.",
					"user_photos": "Provides access to the photos the user has uploaded, and photos the user has been tagged in",
					"user_location": "Provides access to the user's current location as the location property",
					"friends_actions.news": "Allows you to retrieve the actions published by all applications using the built-in news.reads action.",
					"user_actions.music": "Allows you to retrieve the actions published by all applications using the built-in music.listens action.",
					"user_relationship_details": "Provides access to the user's relationship preferences",
					"user_likes": "Provides access to the list of all of the pages the user has liked as the likes connection",
					"friends_checkins": "Provides read access to the authorized user's check-ins or a friend's check-ins that the user can see. This permission is superseded by user_status for new applications as of March, 2012.",
					"user_notes": "Provides access to the user's notes as the notes connection",
					"ads_management": "Provides the ability to manage ads and call the Facebook Ads API on behalf of a user.",
					"user_questions": "Provides access to the questions the user or friend has asked",
					"user_friends": "This permission grants the app permission to read a list of this person's friends who also use your app. If any of this person's friends have chosen not to share their list of friends with your app, they will not show up in the list of friends for this person. Both people must have enable the user_friends permission enabled for a friend to show up in either friend list.",
					"user_actions.books": "Provides access to all common books actions published by any app the person has used. This includes books they've read, want to read, rated or quoted.",
					"user_actions.fitness": "Provides access to all common Open Graph fitness actions published by any app the person has used. This includes runs, walks and bikes actions.",
					"user_managed_groups": "Enables your app to read the Groups a person is an admin of through the groups edge on the User object. This permission does not allow you to create groups on behalf of a person. It is not possible to create groups via the Graph API. This does not let you read the groups a user is just a member of.",
					"user_posts": "Provides access to the posts on a person's Timeline. Includes their own posts, posts they are tagged in, and posts other people make on their Timeline.",
					"user_relationships_details": "Provides access to a person's relationship interests as the interested_in field on the User object.",
					"user_tagged_places": "Provides access to the Places a person has been tagged at in photos, videos, statuses and links.",
					"read_custom_friendlists": "Provides access to the names of custom lists a person has created to organize their friends. This is useful for rendering an audience selector when someone is publishing stories to Facebook from your app.",
					"read_page_mailboxes": "Provides the ability to read from the Page Inboxes of the Pages managed by a person. This permission is often used alongside the manage_pages permission. This permission does not let your app read the page owner's mailbox. It only applies to the page's mailbox.",
					"publish_pages": "When you also have the manage_pages permission, gives your app the ability to post, comment and like as any of the Pages managed by a person using your app. Apps need both manage_pages and publish_pages to be able to publish as a Page. Publishing as an individual personal account is not possible with this permission. To post as an individual, please see the publish_actions permission."
				},
				"separator": ","
			},
			"api_version": {
				"values": {
					"v2.8/": "API version 2.8",
					"v2.9/": "API version 2.9",
					"v2.10/": "API version 2.10",
					"v2.11/": "API version 2.11",
					"v2.12/": "API version 2.12",
					"v3.0/": "API version 3.0",
					"v3.1/": "API version 3.1",
					"v3.2/": "API version 3.2"
				},
				"cardinality": "1"
			}
		}
	},
	"href": {
		"keys": "https://developers.facebook.com/apps",
		"docs": "https://developers.facebook.com/docs/",
		"apps": "https://developers.facebook.com/apps",
		"provider": "https://facebook.com/"
	}
}
