{
	"name": "Google Maps Coordinate",
	"desc": "The Google Maps API allow for the embedding of Google Maps onto web pages of outside developers, using a simple JavaScript interface or a Flash interface. It is designed to work on both mobile devices as well as traditional desktop browser applications. The API includes language localization for over 50 languages, region localization and geocoding, and has mechanisms for enterprise developers who want to utilize the Google Maps API within an intranet. The API HTTP services can be accessed over a secure (HTTPS) connection by Google Maps API Premier customers.",
	"url": "https://accounts.google.com/o/oauth2",
	"oauth2": {
		"authorize": {
			"url": "/auth",
			"query": {
				"client_id": "{client_id}",
				"response_type": "code",
				"redirect_uri": "{{callback}}",
				"state": "{{state}}",
				"scope": "{scope}",
				"access_type": "{access_type}"
			}
		},
		"access_token": {
			"url": "/token",
			"extra": [
				"id_token"
			]
		},
		"request": "https://www.googleapis.com/",
		"refresh": "/token",
		"revoke": {
			"url": "/revoke",
			"method": "post",
			"query": {
				"token": "{{token}}"
			}
		},
		"parameters": {
			"client_id": "string",
			"client_secret": "string",
			"access_type": {
				"values": {
					"online": "Will not provide a refresh_token",
					"offline": "/!\\ Please use server-side only /!\\ If your application needs to refresh access tokens when the user is not present at the browser"
				},
				"cardinality": "1"
			},
			"scope": {
				"values": {
					"https://www.googleapis.com/auth/coordinate.readonly": "View your Google Coordinate jobs",
					"https://www.googleapis.com/auth/coordinate": "View and manage your Google Maps Coordinate jobs",
					"https://www.googleapis.com/auth/tracks": "Google Maps Tracks API, This scope allows read and write access to your project's data.",
					"https://www.googleapis.com/auth/mapsengine": "provides read and write access to the user's Maps Engine data from your application.",
					"https://www.googleapis.com/auth/mapsengine.readonly": "provides read-only access to the user's Maps Engine data from your ",
					"openid": "Access to your id",
					"email": "Get access to your mail. The presence of email requests that the ID Token include email and email_verified claims, and that these values be included in the information available at the userinfo endpoint.",
					"profile": "Get access to your profile. profile will provide an Access Token that can be used to obtain user profile information from the Userinfo endpoint. We recommend using Google+ Sign-In if your application needs user profile information because the Google+ APIs provide a richer set of data that can be controlled by the user",
					"https://www.googleapis.com/auth/gcm_for_chrome": "CloudMessaging for chrome"
				}
			}
		}
	},
	"href": {
		"keys": "https://code.google.com/apis/console/",
		"docs": "https://developers.google.com/coordinate/",
		"apps": "https://code.google.com/apis/console/",
		"provider": "http://google.com/"
	}
}