{
	"name": "GitHub",
    "desc": "GitHub is a repository of public open source and private business code. Is is a fast, efficient, distributed version control system ideal for the collaborative development of software. Use it to fork projects, send pull requests, monitor development.",
	"url": "https://github.com/login/oauth",
	"oauth2": {
		"authorize": "/authorize",
		"access_token": "/access_token",
		"request": {
			"url": "https://api.github.com",
			"cors": true
		},
		"refresh": "/token",
		"parameters": {
			"client_id": "string",
			"client_secret": "string",
			"scope": {
				"values": {
					"user": "Grants read/write access to profile info only. Note that this scope includes user:email and user:follow.",
					"user:email": "Grants read access to a user's email addresses.",
					"user:follow": "Grants access to follow or unfollow other users.",
					"public_repo": "Grants read/write access to code, commit statuses, collaborators, and deployment statuses for public repositories and organizations. Also required for starring public repositories.",
					"repo": "Grants read/write access to code, commit statuses, repository invitations, collaborators, and deployment statuses for public and private repositories and organizations.",
					"repo_deployment": "Grants access to deployment statuses for public and private repositories. This scope is only necessary to grant other users or services access to deployment statuses, without granting access to the code.",
					"repo:status": "Grants read/write access to public and private repository commit statuses. This scope is only necessary to grant other users or services access to private repository commit statuses without granting access to the code.",
					"delete_repo": "Grants access to delete adminable repositories.",
					"notifications": "Grants read access to a user's notifications. repo also provides this access.",
					"gist": "Grants write access to gists.",
					"read:repo_hook": "Grants read and ping access to hooks in public or private repositories.",
					"write:repo_hook": "Grants read, write, and ping access to hooks in public or private repositories.",
					"admin:repo_hook": "Grants read, write, ping, and delete access to hooks in public or private repositories.",
					"admin:org_hook": "Grants read, write, ping, and delete access to organization hooks. Note: OAuth tokens will only be able to perform these actions on organization hooks which were created by the OAuth application. Personal access tokens will only be able to perform these actions on organization hooks created by a user.",
					"read:org": "Read-only access to organization, teams, and membership.",
					"write:org": "Publicize and unpublicize organization membership.",
					"admin:org": "Fully manage organization, teams, and memberships.",
					"read:public_key": "List and view details for public keys.",
					"write:public_key": "Create, list, and view details for public keys.",
					"admin:public_key": "Fully manage public keys.",
					"read:gpg_key": "List and view details for GPG keys.",
					"write:gpg_key": "Create, list, and view details for GPG keys.",
					"admin:gpg_key": "Fully manage GPG keys."
				}
			}
		}
	},
	"href": {
		"keys": "https://github.com/settings/applications/new",
		"docs": "http://developer.github.com/v3/",
		"apps": "https://github.com/settings/applications",
		"provider": "https://github.com/"
	}
}